<template>
<Layout>
    <Head title="Общие положения" />
        <div class="main-footer-box w-full max-w-[1440px] mx-auto relative z-10">
            <div class="first-second-main">
                <div class="persmission-page">
                    <div class="first-persmiss">
                        <p class="title"><span>1</span> Общие положения</p>
                        <div class="first-block-main">
                            <div class="11 points">
                                <p class="point">1.1</p>
                                <p class="text"> Настоящее Пользовательское соглашение (далее - Соглашение) относится к интернет-сайту «Zaka-Zaka», расположенному по адресу https://zaka-zaka.com.
                                    Настоящее Соглашение регулирует отношения между Администрацией сайта «Zaka-Zaka» (далее - Администрация сайта) и Пользователем данного Сайта.</p>
                            </div>
                            <div class="12 points">
                                <p class="point">1.2</p>
                                <p class="text">Администрация сайта оставляет за собой право в любое время изменять, добавлять или удалять пункты настоящего Соглашения без уведомления Пользователя.
                                    Использование Сайта Пользователем означает принятие Соглашения и изменений, внесенных в настоящее Соглашение.</p>
                            </div>
                            <div class="13 points">
                                <p class="point">1.3</p>
                                <p class="text">Пользователь несет персональную ответственность за проверку настоящего Соглашения на наличие изменений в нем.</p>
                            </div>
                            <div class="14 points">
                                <p class="point">1.4</p>
                                <p class="text">Все названия продуктов и игр, компаний, торговых марок, товарные знаки, логотипы и остальные материалы являются собственностью соответствующих владельцев.
                                    Пользователь осознанно соглашается с условиями Соглашения с помощью сервисов сайта (проставлении галочки в соответствующем поле).</p>
                            </div>
                            <div class="15 points">
                                <p class="point">1.5</p>
                                <p class="text">Использование Сайта Пользователем означает принятие Соглашения и изменений, внесенных в настоящее Соглашение.</p>
                            </div>
                            <div class="16 points">
                                <p class="point">1.6</p>
                                <p class="text">Пользователь несет персональную ответственность за проверку настоящего Соглашения на наличие изменений в нем.</p>
                            </div>
                            <div class="17 points">
                                <p class="point">1.7</p>
                                <p class="text">Все названия продуктов и игр, компаний, торговых марок, товарные знаки, логотипы и остальные материалы являются собственностью соответствующих владельцев.
                                    Пользователь осознанно соглашается с условиями Соглашения с помощью сервисов сайта (проставлении галочки в соответствующем поле).</p>
                            </div>
                            <div class="18 points">
                                <p class="point">1.8</p>
                                <p class="text">
                                    Администрация сайта оставляет за собой право в любое время изменять, добавлять или удалять пункты настоящего Соглашения без уведомления Пользователя.
                                    Использование Сайта Пользователем означает принятие Соглашения и изменений, внесенных в настоящее Соглашение.</p>
                            </div>
                            <div class="19 points">
                                <p class="point">1.9</p>
                                <p class="text">
                                    Пользователь несет персональную ответственность за проверку настоящего Соглашения на наличие изменений в нем.</p>
                            </div>
                        </div>
                    </div>
                </div>
                <div class="persmission-page">
                    <div class="first-persmiss">
                        <p class="title"><span>2</span> Определение терминов</p>
                        <div class="first-block-main">
                            <div class="21 points">
                                <p class="point">2.1</p>
                                <p class="text"> Все названия продуктов и игр, компаний, торговых марок, товарные знаки, логотипы и остальные материалы являются собственностью соответствующих владельцев.</p>
                            </div>
                            <div class="22 points">
                                <p class="point">2.2</p>
                                <p class="text">Пользователь осознанно соглашается с условиями Соглашения с помощью сервисов сайта (проставлении галочки в соответствующем поле).<br>Использование Сайта Пользователем означает принятие Соглашения и изменений, внесенных в настоящее Соглашение.</p>
                            </div>
                            <div class="23 points">
                                <p class="point">2.3</p>
                                <p class="text">Пользователь несет персональную ответственность за проверку настоящего Соглашения на наличие изменений в нем.
                                </p>
                            </div>
                            <div class="24 points">
                                <p class="point">2.4</p>
                                <p class="text">Все названия продуктов и игр, компаний, торговых марок, товарные знаки, логотипы и остальные материалы являются собственностью соответствующих владельцев.
                                    Пользователь осознанно соглашается с условиями Соглашения с помощью сервисов сайта (проставлении галочки в соответствующем поле).</p>
                            </div>
                            <div class="25 points">
                                <p class="point">2.5</p>
                                <p class="text">Администрация сайта оставляет за собой право в любое время изменять, добавлять или удалять пункты настоящего Соглашения без уведомления Пользователя.
                                    Использование Сайта Пользователем означает принятие Соглашения и изменений, внесенных в настоящее Соглашение.
                                </p>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
</Layout>
</template>

<script>
import {defineComponent} from 'vue'
import Layout from "../components/layouts/layout.vue";
import {Head} from "@inertiajs/vue3";

export default defineComponent({
    name: "persmiss",
    components: {Layout, Head}
})
</script>

<style scoped>

</style>
