<script setup>
const props = defineProps(['products']);
import {Link, router} from "@inertiajs/vue3";


const destroy = id => {
  router.post(`/profile/deleteProduct/${id}`);
}
</script>


<template>

  <p v-if="products.length === 0" class="text-center">Список ваших товаров пуст</p>
  <div v-else v-for="product in products" class="border-b-2 mb-[28px] border-[#383636] flex justify-between pb-[28px]">
    <div class="flex">
      <div class="flex flex-col">
        <p class="text-[20px] font-[400] sm:text-[12px] whitespace-nowrap align-text-top">
          {{ product.price }} ₽
        </p>
<!--        <p class="text-[16px] sm:text-[14px]">-->
<!--          <span class="text-[#AAAAAA] whitespace-nowrap">3 499₽</span>-->
<!--          <br class="sm:block hidden">-->
<!--          <span class="text-[#F59502] ml-[12px]">-35%</span>-->
<!--        </p>-->
      </div>
      <div class="flex flex-col ml-[56px] sm:ml-[20px]">
        <Link :href="`/product/${product.id}`">
        <p class="text-[20px] sm:text-[14px] font-[400] align-text-top">
          {{ product.name }}
        </p>
        </Link>
      </div>
    </div>
    <div class="flex gap-[22px] sm:gap-[10px]">
      <Link :href="`/profile/editProduct/${product.id}`">
        <svg class="cursor-pointer" width="19" height="19" viewBox="0 0 19 19" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path fill-rule="evenodd" clip-rule="evenodd" d="M14.9883 1.875C14.9731 1.875 14.9584 1.88107 14.9475 1.89195L13.5871 3.25272L15.6483 5.31447L17.008 3.95439C17.0189 3.94351 17.0254 3.92836 17.0254 3.91287C17.0254 3.89738 17.0192 3.88257 17.0084 3.87169L15.0295 1.89229C15.0186 1.88141 15.0036 1.875 14.9883 1.875ZM16.268 7.16978L4.82962 18.6104L2.00612 18.8672C2.00509 18.8673 2.00407 18.8674 2.00304 18.8675C1.93948 18.8735 1.88222 18.875 1.83693 18.875L1.83541 18.875C1.33012 18.8741 0.84839 18.6618 0.506838 18.2897C0.159368 17.9163 -0.0130808 17.4127 0.0326221 16.9046L0.289925 14.0745L11.731 2.63408L13.7092 0.65537C14.0483 0.315827 14.5084 0.125 14.9883 0.125C15.468 0.125 15.9281 0.315699 16.2671 0.655025L18.2453 2.63374C18.5847 2.97289 18.7754 3.43306 18.7754 3.91287C18.7754 4.39267 18.5847 4.85284 18.2453 5.192L16.268 7.16978ZM12.3497 4.49022L1.97537 14.864L1.77559 17.0613C1.77558 17.0614 1.77559 17.0613 1.77559 17.0613C1.77444 17.0747 1.779 17.088 1.78808 17.0977L1.79596 17.1061C1.80692 17.1181 1.8223 17.125 1.83844 17.125L1.84254 17.1249L4.04006 16.925L14.411 6.55205L12.3497 4.49022Z" fill="#4A4A51"/>
        </svg>
      </Link>
      <svg @click="destroy(product.id)" class="cursor-pointer" width="20" height="22" viewBox="0 0 20 22" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path fill-rule="evenodd" clip-rule="evenodd" d="M7.78427 0.875732C6.81051 0.875732 5.95468 1.52856 5.70196 2.47371C5.69714 2.49176 5.69289 2.50995 5.68923 2.52827L5.4463 3.74392L5.44628 3.74405L5.44623 3.74427C5.37388 4.10469 5.05662 4.36473 4.68927 4.36473C4.68763 4.36473 4.68598 4.36474 4.68434 4.36475H1.42188C0.938626 4.36475 0.546875 4.7565 0.546875 5.23975C0.546875 5.723 0.938626 6.11475 1.42188 6.11475H18.3799C18.8631 6.11475 19.2549 5.723 19.2549 5.23975C19.2549 4.7565 18.8631 4.36475 18.3799 4.36475H15.1172C15.1156 4.36474 15.1139 4.36473 15.1123 4.36473C14.7448 4.36473 14.4275 4.10453 14.3552 3.74392L14.1123 2.52827C14.1086 2.50995 14.1044 2.49176 14.0996 2.47371C13.8469 1.52856 12.991 0.875732 12.0173 0.875732H7.78427ZM12.7113 4.36475C12.6824 4.27464 12.6583 4.18215 12.6393 4.08755L12.6392 4.0872L12.4033 2.90636C12.3498 2.73996 12.1947 2.62573 12.0173 2.62573H7.78427C7.60684 2.62573 7.45174 2.73996 7.39828 2.90635L7.16231 4.0872L7.16224 4.08755C7.14329 4.18215 7.11919 4.27464 7.09025 4.36475H12.7113ZM3.76437 9.34747L4.49648 17.6867C4.58035 18.642 5.38037 19.3749 6.33939 19.3749H13.4671C14.4272 19.3749 15.2278 18.6404 15.3102 17.6838L16.0288 9.34747H3.76437ZM2.61815 7.59747C2.20739 7.59747 1.88491 7.9495 1.92083 8.35869L2.75318 17.8397C2.91639 19.6988 4.47318 21.1249 6.33939 21.1249H13.4671C15.3354 21.1249 16.8933 19.6956 17.0538 17.8341L17.8706 8.35759C17.9058 7.94878 17.5835 7.59747 17.1732 7.59747H2.61815Z" fill="#4A4A51"/>
      </svg>
    </div>
  </div>
  <div class="flex justify-end">
    <Link href="/profile/create-product">
      <button class="text-black bg-white hover:bg-c_orange hover:text-white transition-all px-4 py-2 rounded-lg">Создать товар</button>
    </Link>
  </div>
</template>


<style scoped>

</style>
